src/InformationRegisters/ВЧ_ОчередьУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВЧ_ОчередьУведомлений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Значение по умолчанию: "Ожидает"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВЧ_СтатусыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПопыткиОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Comment>Значение по умолчанию: "НовыйСотрудник"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Comment>Доп. данные (ФИО, телефон и т.д.)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Когда задача поставлена в очередь</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйКадровик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИДСообщения</Name>
					<Comment>Ключ уникальности (GUID)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDКанала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВЧ_СтатусыУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВЧ_СтатусыУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ВЧ_ИнтеграцияСервер/Ext/Module.bsl
// ##############################################################################
// Интеграция с VoceChat (Сервер)
// ##############################################################################

#Область ПрограммныйИнтерфейс

// Описание:
// Отправляет сообщение в указанный канал VoceChat через Bot API.
// Используется регламентным заданием для обработки очереди.
//
// Параметры:
//  СсылкаНаСотрудника - СправочникСсылка.Сотрудники - Ссылка на сотрудника для логирования
//  ТекстСообщения - Строка - Текст сообщения в формате Markdown
//
// Возвращаемое значение:
//  Структура - Структура { Успех: Булево, ТекстОшибки: Строка }
//
&НаСервере
Функция ОтправитьУведомление(СсылкаНаСотрудника, ТекстСообщения) Экспорт 
	
	Если Не Константы.ВЧ_ИспользоватьИнтеграцию.Получить() Тогда
		Возврат СоздатьРезультатОтправки(Истина, "Интеграция отключена");
	КонецЕсли;
	
	Настройки = ПолучитьНастройки();
	
	РезультатВалидации = ПроверитьНастройки(Настройки);
	Если Не РезультатВалидации.Успех Тогда
		ЗаписатьОшибкуРегистрации(СсылкаНаСотрудника, РезультатВалидации.ТекстОшибки);
		Возврат РезультатВалидации;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		ТекстОшибки = "Пустой текст сообщения";
		ЗаписатьОшибкуРегистрации(СсылкаНаСотрудника, ТекстОшибки);
		Возврат СоздатьРезультатОтправки(Ложь, ТекстОшибки);
	КонецЕсли;
	
	РезультатОтправки = ВыполнитьЗапросКAPI(Настройки, ТекстСообщения);
	
	Если РезультатОтправки.Успех Тогда
		ЗаписатьИнформациюРегистрации(СсылкаНаСотрудника, 
			"Уведомление успешно отправлено в канал " + Настройки.ИдентификаторКанала);
	Иначе
		ЗаписатьОшибкуРегистрации(СсылкаНаСотрудника, РезультатОтправки.ТекстОшибки);
	КонецЕсли;
	
	Возврат РезультатОтправки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Описание:
// Вспомогательная функция для получения настроек из констант.
//
// Возвращаемое значение:
//  Структура - Структура с настройками интеграции: URL, Порт, BotAPIKey, ИдентификаторКанала, ТаймаутСекунд
//
&НаСервере
Функция ПолучитьНастройки()
	
	Настройки = Новый Структура();
	Настройки.Вставить("URL", Константы.ВЧ_URLСервера.Получить());
	Настройки.Вставить("Порт", Константы.ВЧ_ПортСервера.Получить());
	Настройки.Вставить("BotAPIKey", Константы.ВЧ_BotAPIKey.Получить());
	Настройки.Вставить("ИдентификаторКанала", Константы.ВЧ_IDКанала.Получить());
	Настройки.Вставить("ТаймаутСекунд", Константы.ВЧ_ТаймаутHTTP.Получить());
	
	Возврат Настройки;
	
КонецФункции

// Описание:
// Проверяет корректность настроек интеграции.
//
// Параметры:
//  Настройки - Структура - Структура с настройками интеграции
//
// Возвращаемое значение:
//  Структура - Структура { Успех: Булево, ТекстОшибки: Строка }
//
&НаСервере
Функция ПроверитьНастройки(Настройки)
	
	Если ПустаяСтрока(Настройки.URL) Тогда
		Возврат СоздатьРезультатОтправки(Ложь, "Не указан URL сервера");
	КонецЕсли;
	
	Если Настройки.Порт <= 0 Тогда
		Возврат СоздатьРезультатОтправки(Ложь, "Некорректный порт сервера");
	КонецЕсли;
	
	Если ПустаяСтрока(Настройки.BotAPIKey) Тогда
		Возврат СоздатьРезультатОтправки(Ложь, "Не указан BotAPIKey");
	КонецЕсли;
	
	Если ПустаяСтрока(Настройки.ИдентификаторКанала) Тогда
		Возврат СоздатьРезультатОтправки(Ложь, "Не указан идентификатор канала");
	КонецЕсли;    
	
	Если ПустаяСтрока(Настройки.ТаймаутСекунд) Тогда 
		Возврат СоздатьРезультатОтправки(Ложь, "Не указан таймаут HTTP в секундах");
	КонецЕсли;
	
	Возврат СоздатьРезультатОтправки(Истина, "");
	
КонецФункции

// Описание:
// Отправляет HTTP запрос к VoceChat API.
//
// Параметры:
//  Настройки - Структура - Настройки интеграции
//  ТекстСообщения - Строка - Текст сообщения
//
// Возвращаемое значение:
//  Структура - Структура { Успех: Булево, ТекстОшибки: Строка }
//
&НаСервере
Функция ВыполнитьЗапросКAPI(Настройки, ТекстСообщения)
	
	Перем HTTPКодУспех;
	Перем HTTPКодРедирект;
	
	HTTPКодУспех = 200;
	HTTPКодРедирект = 300;
	
	URI = СтрШаблон("/api/bot/send_to_group/%1", Настройки.ИдентификаторКанала);
	
	HTTP = Неопределено;
	Попытка
		HTTP = Новый HTTPСоединение(
			Настройки.URL, 
			Настройки.Порт, 
			, 
			, 
			, 
			Настройки.ТаймаутСекунд);
		
		Заголовки = Новый Соответствие();
		Заголовки.Вставить("x-api-key", Настройки.BotAPIKey);
		Заголовки.Вставить("Content-Type", "text/markdown");
		
		ЗапросHTTP = Новый HTTPЗапрос(URI, Заголовки);
		ЗапросHTTP.УстановитьТелоИзСтроки(ТекстСообщения, КодировкаТекста.UTF8);
		
		Ответ = HTTP.ВызватьHTTPМетод("POST", ЗапросHTTP);
		
		Если Ответ.КодСостояния >= HTTPКодУспех И Ответ.КодСостояния < HTTPКодРедирект Тогда
			Возврат СоздатьРезультатОтправки(Истина, "");
		КонецЕсли;
		
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Возврат СоздатьРезультатОтправки(Ложь, СтрШаблон("HTTP %1: %2", Ответ.КодСостояния, ТелоОтвета));
		
	Исключение
		Возврат СоздатьРезультатОтправки(Ложь, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// Описание:
// Создает структуру результата отправки уведомления.
//
// Параметры:
//  Успех - Булево - Признак успешной отправки
//  ТекстОшибки - Строка - Текст ошибки при неуспешной отправке
//
// Возвращаемое значение:
//  Структура - Структура с полями Успех и ТекстОшибки
//
&НаСервере
Функция СоздатьРезультатОтправки(Знач Успех, Знач ТекстОшибки = "")
	
	Возврат Новый Структура("Успех, ТекстОшибки", Успех, ТекстОшибки);
	
КонецФункции

// Описание:
// Записывает сообщение об ошибке в журнал регистрации.
//
// Параметры:
//  СсылкаНаСотрудника - СправочникСсылка.Сотрудники - Ссылка на сотрудника для логирования
//  ТекстОшибки - Строка - Текст ошибки
//
&НаСервере
Процедура ЗаписатьОшибкуРегистрации(СсылкаНаСотрудника, ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(
		"ВЧ_Интеграция", 
		УровеньЖурналаРегистрации.Ошибка, 
		, 
		СсылкаНаСотрудника, 
		ТекстОшибки);
	
КонецПроцедуры

// Описание:
// Записывает информационное сообщение в журнал регистрации.
//
// Параметры:
//  СсылкаНаСотрудника - СправочникСсылка.Сотрудники - Ссылка на сотрудника для логирования
//  ТекстСообщения - Строка - Текст сообщения
//
&НаСервере
Процедура ЗаписатьИнформациюРегистрации(СсылкаНаСотрудника, ТекстСообщения)
	
	ЗаписьЖурналаРегистрации(
		"ВЧ_Интеграция", 
		УровеньЖурналаРегистрации.Информация, 
		, 
		СсылкаНаСотрудника, 
		ТекстСообщения);
	
КонецПроцедуры

// Описание:
// Получает текст из хранилища значений.
//
// Параметры:
//  Хранилище - ХранилищеЗначение - Хранилище значений для чтения
//
// Возвращаемое значение:
//  Произвольный - Значение из хранилища или Неопределено при ошибке
//
&НаСервере
Функция ПолучитьТекстИзХранилищаСервер(Хранилище) Экспорт
	
	Если Хранилище = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ТипЗнч(Хранилище) = Тип("ХранилищеЗначения") Тогда
		Возврат Хранилище.Получить();
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ПовторитьОтправку(Знач МассивКлючей) Экспорт
	// МассивКлючей — это массив структур {ИДСообщения, IDКанала}
	
	Для Каждого Ключ ИЗ МассивКлючей Цикл
		НаборЗаписей = РегистрыСведений.ВЧ_ОчередьУведомлений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИДСообщения.Установить(Ключ.ИДСообщения);
		НаборЗаписей.Отбор.IDКанала.Установить(Ключ.IDКанала);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись ИЗ НаборЗаписей Цикл
			Если Запись.Статус <> Перечисления.ВЧ_СтатусыУведомлений.Отправлено Тогда
				Запись.Статус = Перечисления.ВЧ_СтатусыУведомлений.Ожидает;
				Запись.ПопыткиОтправки = 0;
				Запись.ТекстОшибки = "";
				Запись.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиИстории(Знач МассивКлючей) Экспорт
	// МассивКлючей — это массив структур {ИДСообщения, IDКанала}
	
	Для Каждого Ключ ИЗ МассивКлючей Цикл
		НаборЗаписей = РегистрыСведений.ВЧ_ОчередьУведомлений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИДСообщения.Установить(Ключ.ИДСообщения);
		НаборЗаписей.Отбор.IDКанала.Установить(Ключ.IDКанала);
		// Запись пустого набора = удаление
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ДлительныеОперации

// Выполняет заполнение сотрудников в фоновом задании
// Параметры:
//   ПараметрыВыполнения - Структура - параметры длительной операции
//   АдресРезультата - Строка - адрес для сохранения результата
//
&НаСервере
Процедура ЗаполнитьСотрудниковВИсторииФоновое(ПараметрыВыполнения, АдресРезультата) Экспорт
	
	РезультатВыполнения = Новый Структура("Записано, КоличествоОшибок", 0, 0);
	ИмяСобытия = "ВЧ_ЗаполнениеСотрудников";
	
	// Параметры из формы
	ПакетныйЛимит = ?(ПараметрыВыполнения.Свойство("ПакетныйЛимит"), ПараметрыВыполнения.ПакетныйЛимит, 100);
	ИнтервалЛогирования = ?(ПараметрыВыполнения.Свойство("ИнтервалЛогирования"), ПараметрыВыполнения.ИнтервалЛогирования, 1);
	КоличествоСтрокДляОтладки = ?(ПараметрыВыполнения.Свойство("КоличествоСтрокДляОтладки"), ПараметрыВыполнения.КоличествоСтрокДляОтладки, 0);
	
	// Если интервал логирования 0 или 1, логируем каждый пакет
	Если ИнтервалЛогирования = 0 Или ИнтервалЛогирования = 1 Тогда
		ИнтервалЛогирования = 1;
	КонецЕсли;
	
	ЗапросСчет = Новый Запрос;
	ЗапросСчет.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК ВсегоЗаписей
	|ИЗ
	|	РегистрСведений.ВЧ_ОчередьУведомлений
	|ГДЕ
	|	Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ДокументОснование = ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка)";
	
	РезультатСчета = ЗапросСчет.Выполнить();
	ВыборкаСчета = РезультатСчета.Выбрать();
	
	ВсегоЗаписей = 0;
	Если ВыборкаСчета.Следующий() Тогда
		ВсегоЗаписей = ВыборкаСчета.ВсегоЗаписей;
	КонецЕсли;
	
	Если ВсегоЗаписей = 0 Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , , 
			"Нет записей для обработки");
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ТекстРежима = "";
	Если КоличествоСтрокДляОтладки > 0 Тогда
		ВсегоЗаписей = Мин(ВсегоЗаписей, КоличествоСтрокДляОтладки);
		ТекстРежима = СтрШаблон(" (отладка: %1 записей)", КоличествоСтрокДляОтладки);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , , 
		СтрШаблон("Начало миграции%1. Всего записей: %2, пакет: %3", ТекстРежима, ВсегоЗаписей, ПакетныйЛимит));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИДСообщения КАК ИДСообщения,
	|	ДокументОснование КАК ДокументОснование
	|ИЗ
	|	РегистрСведений.ВЧ_ОчередьУведомлений
	|ГДЕ
	|	Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И НЕ ДокументОснование = ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	ИДСообщения";
	
	// Ограничиваем количество записей для отладки
	Если КоличествоСтрокДляОтладки > 0 Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + СтрШаблон("СГУСТИТЬ ПЕРВЫЕ %1", КоличествоСтрокДляОтладки);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Обработано = 0;
	Записано = 0;
	Ошибок = 0;
	Пакет = 0;
	НомерПакета = 0;
	ЗаписиПакета = "";
	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл
		
		ИДСообщения = Выборка.ИДСообщения;
		
		// Собираем записи пакета для логирования
		Если ПустаяСтрока(ЗаписиПакета) Тогда
			ЗаписиПакета = ИДСообщения;
		Иначе
			ЗаписиПакета = ЗаписиПакета + ", " + ИДСообщения;
		КонецЕсли;
		
		Попытка
			ДокументОснование = Выборка.ДокументОснование;
			
			Сотрудник = ДокументОснование.Сотрудник;
			
			Если ЗначениеЗаполнено(Сотрудник) Тогда
				Набор = РегистрыСведений.ВЧ_ОчередьУведомлений.СоздатьНаборЗаписей();
				Набор.Отбор.ИДСообщения.Установить(ИДСообщения);
				Набор.Прочитать();
				
				Если Набор.Количество() > 0 Тогда
					СтрокаНабора = Набор[0];
					СтрокаНабора.Сотрудник = Сотрудник;
					Набор.Записать(Истина);
					Записано = Записано + 1;
				КонецЕсли;
			КонецЕсли;
			
		Исключение
			Ошибок = Ошибок + 1;
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , 
				"Ошибка при обработке " + ИДСообщения);
		КонецПопытки;
		
		Обработано = Обработано + 1;
		Пакет = Пакет + 1;
		
		// ФИКСИРУЕМ транзакцию пакетом и логируем результат
		Если Пакет >= ПакетныйЛимит Тогда
			ЗафиксироватьТранзакцию();
			НомерПакета = НомерПакета + 1;
			
			// Логируем только если номер пакета кратен интервалу логирования
			Если НомерПакета % ИнтервалЛогирования = 0 Тогда
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , , 
					СтрШаблон("Пакет %1: обработано %2, записано %3, ошибок %4. Записи: [%5]", 
						НомерПакета, Пакет, Записано, Ошибок, ЗаписиПакета));
			КонецЕсли;
			
			НачатьТранзакцию();
			Пакет = 0;
			ЗаписиПакета = "";
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	// Если остались записи в последнем пакете
	Если Обработано % ПакетныйЛимит <> 0 Тогда
		НомерПакета = НомерПакета + 1;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , , 
			СтрШаблон("Пакет %1 (последний): обработано %2, записано %3, ошибок %4. Записи: [%5]", 
				НомерПакета, Обработано % ПакетныйЛимит, Записано, Ошибок, ЗаписиПакета));
	КонецЕсли;
	
	РезультатВыполнения.Записано = Записано;
	РезультатВыполнения.КоличествоОшибок = Ошибок;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , , 
		СтрШаблон("Миграция завершена. Пакетов: %1, Всего записано: %2, Ошибок: %3", 
			НомерПакета, Записано, Ошибок));
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти
